docs/7.User_interface.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-04-04 Sat 16:56 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Roguelike Game in C++17</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Neel Raiyani [Roy Fokker]">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link href="org.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Roguelike Game in C++17</h1>
<p class="subtitle">User Interface.</p>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga7e51b3">Goals</a></li>
<li><a href="#org94f087a">Refactor</a></li>
<li><a href="#org3a3330b">Panels and Status bar</a></li>
<li><a href="#org7eb547c">Links</a></li>
</ul>
</div>
</nav>
<p>
So far all the Textual information hasn't been getting to the player from
within the game. We write it out to console, which is silly. 
</p>

<div id="outline-container-orga7e51b3" class="outline-2">
<h2 id="orga7e51b3">Goals</h2>
<div class="outline-text-2" id="text-orga7e51b3">
<p>
Things to accomplish for this section.
</p>
<ul class="org-ul">
<li>Status Bar, to show Player's Health</li>
<li>Message Log, to show Actions by and around the player</li>
<li>Looking at Enemy's Status.</li>
</ul>
</div>
</div>

<div id="outline-container-org94f087a" class="outline-2">
<h2 id="org94f087a">Refactor</h2>
<div class="outline-text-2" id="text-org94f087a">
</div>
<div id="outline-container-org9637c85" class="outline-3">
<h3 id="org9637c85">C++ Project configuration.</h3>
<div class="outline-text-3" id="text-org9637c85">
<p>
Before we start, I want to refactor some items in out project.
First items to refactor is how CMake is configured. To follow some of the recommendation
on how CMake is supposed to be used, by <code>*learned peoples*</code>.
</p>

<p>
I would like to decouple some things from how CMake Project itself. As these
settings I use with every project. To this end, there is now a new folder 
<code>cmake</code> within which exist following two files, <code>vcpkg.cmake</code> 
and <code>msvc_settings.cmake</code>.
</p>

<p>
<code>vcpkg.cmake</code>, which will contain CMake script to load the <code>vcpkg</code> toolchain
file. 
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7a/cmake/vcpkg.cmake" width=800 commentWidth=50>
</ui-code>

<p>
Which we will call from <code>CMakeLists.txt</code> at project root as such, it must be called
before we call <code>project</code> command:
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7a/CMakeLists.txt#L9-L16" width=800 commentWidth=50>
</ui-code>

<p>
Next, the plan is to pull as the MSVC specific settings out of <code>CMakeLists.txt</code>.
To do this we will use <code>msvc_settings.cmake</code>. The settings will only be 
activated if compiler is MSVC. It will setup some defaults for MSVC as well as provide some 
options for per-project configuration, to enable C++17 or C++20 features 
in MSVC, default is to use C++17.
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7a/cmake/msvc_settings.cmake" width=800 commentWidth=50>
</ui-code>

<p>
And it can be used as such, in root <code>CMakeLists.txt</code> we create a new library
interface. Then call the <code>set_msvc_project_configuration</code> function 
from <code>cmake/msvc_settings.cmake</code>, to set the configuration we want with MSVC.
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7a/CMakeLists.txt#L12-L28" width=800 commentWidth=50>
</ui-code>

<p>
Next we have to change <code>src/CMakeLists.txt</code>, to remove all the compiler
specific stuff, as well as tell CMake to use settings from Library interface 
from root <code>CMakeLists.txt</code>.
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7a/src/CMakeLists.txt#L26-L41" width=800 commentWidth=50>
</ui-code>

<p>
With this done, it makes it easy for us in future to make new projects with similar settings.
Anything to ease the pain of project managment in C++.
</p>
</div>
</div>

<div id="outline-container-orgdc38b0c" class="outline-3">
<h3 id="orgdc38b0c">Console drawing cleanup</h3>
<div class="outline-text-3" id="text-orgdc38b0c">
<p>
In order to show the ui, we will create a new <code>console_layer</code> and do all our ui rendering to that. We'd already setup 
ability to do this several commits ago. However, to make it more clearer to understand, we'll make few changes to how
<code>console_layer</code> works.
</p>

<p>
First of which is to have it store layer position, previously we passed this <code>position</code> in as part of the <code>blit</code> function.
Well, we intended to do that, but never utilized it. So we'll remove it from <code>blit</code> function.
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/console.hpp#L55-L56" width=500 commentWidth=500>
</ui-code>

<p>
And add it to the constructor of <code>console_layer</code>
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/console.hpp#L71-L72" width=500 commentWidth=500>
</ui-code>

<p>
Update the <code>console.cpp</code> file, as such  
<code>blit</code> function
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/console.cpp#L56-L63" width=500 commentWidth=500>
</ui-code>

<p>
and the <code>console_layer</code> constructor 
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/console.cpp#L70-L71" width=500 commentWidth=500>
</ui-code>

<p>
Next we need to modify <code>main.cpp</code> to accomodate the UI aspects. We'll specify new 
variable to hold UI height and Map&lt;-&gt;UI split location.
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/main.cpp#L27-L30" width=500 commentWidth=500>
</ui-code>

<p>
Create two <code>console_layer</code> objects for map and UI respectively, using above variables. And
update the call to <code>generate_map</code> function so it uses proper height.
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/main.cpp#L32-L41" width=500 commentWidth=500>
</ui-code>

<p>
Add the scafolding for UI drawing in the main loop.
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/main.cpp#L78-L82" width=500 commentWidth=500>
</ui-code>

<p>
Next we are going to clean up how we call layer drawing functions, such that they don't need to know 
about <code>game_map</code>, <code>fov_map</code>, or <code>game_entity</code>. To do this we will add new <code>cell</code> type. In order to be 
able to hold color information we are also going to forward declare <code>TCODColor</code>.
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/console.hpp#L28-L36" width=500 commentWidth=500>
</ui-code>

<p>
We will remove the two overloaded <code>draw</code> methods from <code>console_layer</code> class, and replace them with 
<code>draw</code> method that takes in a vector of <code>cell</code>.
</p>

<p>
<code>console.hpp</code>
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/console.hpp#L76-L77" width=500 commentWidth=500>
</ui-code>

<p>
<code>console.cpp</code>
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/console.cpp#L85-L102" width=500 commentWidth=500>
</ui-code>

<p>
In <code>main.cpp</code> we'll update the calls so <code>map_layer.draw</code> is passed a vector via <code>prepare_to_draw</code> function.
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/main.cpp#L75-L76" width=500 commentWidth=500>
</ui-code>

<p>
Then we'll add the <code>prepare_to_draw</code> function in both <code>game_map.[cpp|hpp]</code> and <code>game_entity.[cpp|hpp]</code> file sets.
These functions will basically contain the logic that we had in <code>console.cpp</code>.
<code>game_map.hpp</code>
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/game_map.hpp#L98-L100" width=500 commentWidth=500>
</ui-code>

<p>
To transform from <code>tile</code> to <code>cell</code> we are using <code>cppitertools</code>'s <code>imap</code> functionality. For each element in 
tiles list, it will give us a <code>cell</code>.
<code>game_map.cpp</code>
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/game_map.cpp#L342-L368" width=500 commentWidth=500>
</ui-code>

<p>
<code>game_entity.hpp</code>
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/game_entity.hpp#L76-L78" width=500 commentWidth=500>
</ui-code>

<p>
<code>game_entity.cpp</code>
</p>
<ui-code url="https://raw.githubusercontent.com/Roy-Fokker/roguelike/Part-7b/src/game_entity.cpp#L157-L182" width=500 commentWidth=500>
</ui-code>
</div>
</div>
</div>

<div id="outline-container-org3a3330b" class="outline-2">
<h2 id="org3a3330b">Panels and Status bar</h2>
</div>




<div id="outline-container-org7eb547c" class="outline-2">
<h2 id="org7eb547c">Links</h2>
<div class="outline-text-2" id="text-org7eb547c">
<p>
╣ <a href="https://github.com/Roy-Fokker/roguelike/tree/Part-6d">GitHub Repo</a> ╠═══<br>
╣ <a href="index.html">Home</a> ╠═══<br>
╣ Prev: <a href="6.Combat.html">Combat</a> ╠═══<br>
╣ Next: <a href="8.Inventory.html">Items and inventory</a> ╠═══
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Neel Raiyani [Roy Fokker]</p>
<p class="date">Created: 2020-04-04 Sat 16:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
